Rails/First_Routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rahul Agarwal"], ["email", "rahul.agarwal2504@gmail.com"], ["created_at", "2022-02-23 06:48:30.596974"], ["updated_at", "2022-02-23 06:48:30.596974"]]
---
    def create
        user= User.new(person_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Rachit Agarwal"], ["email", "rachit.agarwal2512@gmail.com"], ["updated_at", "2022-02-23 07:07:53.274805"], ["id", 1]]
---
    def update
        user= User.find(params[:id])
        updated_user = user.update(params.require(:person).permit(:name, :email))