SQL/URLShorterer/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "GxJPWC1zCFFp8xMamkBbng"], ["LIMIT", 1]]
---
    def self.random_code
        loop do
            random_code= SecureRandom::urlsafe_base64(16)
            return random_code unless ShortenedUrl.exists?(short_url: random_code)

INSERT INTO "shortened_urls" ("short_url", "long_url", "submit_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def self.create_for_user_and_long_url!(user, long_url)
        ShortenedUrl.create!({
            long_url: long_url,
            submit_user_id: user.id,
            short_url: ShortenedUrl.random_code
        })