Rails/Art Share/app/controllers/artworks_controller.rb

    def like
        like= Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: :Artwork)
        if like.save
---
INSERT INTO "likes" ("likeable_id", "likeable_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_id", 3], ["likeable_type", "Artwork"], ["user_id", 9], ["created_at", "2022-02-25 08:13:14.135233"], ["updated_at", "2022-02-25 08:13:14.135233"]]