Rails/Art Share/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 9]]
SELECT "comments".* FROM "comments"
---
    def index
        case
        when params[:user_id]
            comments= Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
            comments= Comment.where(artwork_id: params[:artwork_id])
        else
            comments= Comment.all

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        comment= Comment.find(params[:id])

INSERT INTO "likes" ("likeable_id", "likeable_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_id", 1], ["likeable_type", "Comment"], ["user_id", 9], ["created_at", "2022-02-25 08:16:48.671472"], ["updated_at", "2022-02-25 08:16:48.671472"]]
---
    def like
        like= Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: :Comment)
        if like.save