Rails/Art Share/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '% Arpit%')
---
    def index
        if params[:query]
            user= User.where('username LIKE ?', "%#{params[:query]}%")
        else
            user= User.all